/**
 * @file Network.c
 * @author ryhoh
 * @brief ネットワークによる曲選択ロジック
 * 
 * @copyright Copyright (c) 2024
 * 
 */

/* include *******************************************************************************************/
#include "Network.h"
/* variable ******************************************************************************************/
static uint32_t zul_NW_SelectedScoreIdx = 0;   /* [-,-] NW_選択曲インデックス */
/* prototype *****************************************************************************************/
/* function ******************************************************************************************/
/* Interface *****************************************************************************************/
/**
 * @brief NW_選択曲インデックス取得
 * 
 */
uint32_t NW_GetSelectedScoreIdx(void) {
    return zul_NW_SelectedScoreIdx;
}
