/**
 * @file Network.h
 * @author ryhoh
 * @brief ネットワークによる曲選択ロジック
 * 
 * @copyright Copyright (c) 2024
 * 
 */

/* include *******************************************************************************************/
#include <Arduino.h>

#include "../common.h"
#include "../configure.h"
/* function ******************************************************************************************/
void NW_Main(void);
uint8_t NW_GetSelectedScoreIdx(void);
/* ***************************************************************************************************/
