/**
 * @file DIP.h
 * @author ryhoh
 * @brief DIPスイッチ入力の処理を行う
 * 
 * @copyright Copyright (c) 2024
 * 
 */

/* include *******************************************************************************************/
#include <Arduino.h>

#include "../common.h"
#include "../configure.h"
/* function ******************************************************************************************/
void DIP_Main(void);
uint32_t DIP_GetSwitchState(void);
/* ***************************************************************************************************/
