/**
 * @file common.c
 * @author ryhoh
 * @brief 共通の定義を記述する
 * @date 2024-04-06
 * 
 * @copyright Copyright (c) 2024
 * 
 */

#ifndef __COMMON_H__
#define __COMMON_H__

/* define *******************************************************************************************/
#define Y_OFF                           (0)         /*                                              */
#define Y_ON                            (1)         /*                                              */

#define M_MAX(a, b)                     ((a) > (b) ? (a) : (b))    /* 最大値を取得 */
/* **************************************************************************************************/

#endif /* __COMMON_H__ */
